Repository: NTech-Lab/android
Catalog: docs/locales/*/LC_MESSAGES/build.po
Languages: ru

source: Building App from Source Code
ru: Сборка приложения из исходного кода

source: To build the FindFace demo app from source code (provided as an Android project), do the following:
ru: Для того чтобы собрать демо-приложение FindFace из исходного кода (проекта Android), выполните следующие действия:

source: Start :program:`Android Studio`. On the welcome screen, click :guilabel:`Import Project`.
ru: Запустите :program:`Android Studio`. На экране приветствия нажмите :guilabel:`Import Project`.

source: Select the project folder. Click :guilabel:`OK`.
ru: Укажите папку с проектом Android. Нажмите :guilabel:`OK`.

source: Wait until the project is fully loaded, and :program:`Android Studio` is finished starting. This may take a while.
ru: Дождитесь окончания загрузки проекта и запуска модулей :program:`Android Studio`. Это может занять некоторое время.

source: Once the progress bar at the bottom disappears, you are all set to start building the app.
ru: Как только индикатор процессов на нижней панели исчезнет, можно начинать сборку приложения.

source: To select the build variant, invoke the |green| :guilabel:`Build Variants` tool window.
ru: Для того чтобы выбрать вариант сборки, вызовите окно инструментов |green| :guilabel:`Build Variants`.

source: Select the :guilabel:`masterRelease` build variant.
ru: Выберите вариант сборки :guilabel:`masterRelease`.

source: On the build panel, activate the :guilabel:`app` module.
ru: На панели сборки активируйте модуль :guilabel:`app`.

source: In the main menu, navigate to :menuselection:`Build --> Build APK`. It will launch building an APK of all the application modules in the current project.
ru: В главном меню выберите :menuselection:`Build --> Build APK`. Это запустит сборку APK из всех модулей приложения текущего проекта.

source: Wait until the build completes. Once it does, the progress bar at the bottom will disappear. The build will generate the ``app-master-release-v1.0.0.apk`` artifact.
ru: Дождитесь окончания сборки. Индикатор на нижней панели при этом исчезнет. Артефакт сборки будет сгенерирован под именем ``app-master-release-v1.0.0.apk``.

source: To open the APK, click the :guilabel:`Event log` button at the bottom.
ru: Для того чтобы открыть APK, нажмите внизу кнопку :guilabel:`Event log`.

source: On the tab that appears, click the ``Show in Explorer`` link.
ru: На появившейся вкладке нажмите ссылку ``Show in Explorer``.

source: You are now finished!
ru: Процесс сборки на этом будет завершен.
